import matplotlib.pyplot as plt
from datetime import datetime, timedelta
import matplotlib.dates as mdates


data_conc= {
    'первый ярус фундаментной плиты камеры шлюза': ('18-12-2024', '12-05-2025'),
    'второй ярус фундаментной плиты камеры шлюза': ('27-02-2025', '22-06-2025'),
    'третий ярус фундаментной плиты камеры шлюза': ('20-03-2025', '15-06-2025'),
    'стены камеры шлюза': ('02-04-2025', '14-10-2025'),
    'первый ярус НГ блок I-1': ('15-05-2025', '14-06-2025'),
    'первый ярус НГ блок I-2': ('18-05-2025', '19-06-2025'),
    'первый ярус НГ блок I-3': ('06-06-2025', '02-07-2025'),
    'первый ярус НГ блок I-4': ('05-06-2025', '01-07-2025'),
    'первый ярус НГ блок I-5': ('18-05-2025', '10-06-2025'),
    'первый ярус НГ блок I-6': ('29-05-2025', '08-06-2025'),
    'первый ярус НГ блок I-7': ('21-06-2025', '01-07-2025'),
    'первый ярус НГ блок I-8': ('21-06-2025', '01-07-2025'),
    'второй ярус НГ блок II-1': ('18-07-2025', '17-08-2025'),
    'второй ярус НГ блок II-2': ('15-06-2025', '14-07-2025'),
    'второй ярус НГ блок II-3': ('24-06-2025', '26-07-2025'),
    'второй ярус НГ блок II-4': ('30-07-2025', '29-08-2025'),
    'третий ярус НГ блок III-1-1': ('30-07-2025', '17-08-2025'),
    'третий ярус НГ блок III-1-2': ('24-07-2025', '11-08-2025'),
    'третий ярус НГ блок III-1-3': ('30-07-2025', '17-08-2025'),
    'третий ярус НГ блок III-1-4': ('24-07-2025', '11-08-2025'),
    'третий ярус НГ блок III-2': ('27-08-2025', '14-09-2025'),
    'третий ярус НГ блок III-3': ('15-08-2025', '02-09-2025'),
    'третий ярус НГ блок III-4': ('12-07-2025', '30-07-2025'),
    'третий ярус НГ блок III-5': ('18-07-2025', '05-08-2025'),
    'демонтаж распорной системы НГ': ('30-08-2025', '08-09-2025'),
    'четвёртый ярус НГ (скольз. опалубка) блок IV-3-1': ('09-09-2025', '13-10-2025'),
    'четвёртый ярус НГ (скольз. опалубка) блок IV-3-2': ('09-09-2025', '13-10-2025'),
    'четвёртый ярус НГ (скольз. опалубка) блок IV-3-3': ('09-10-2025', '12-11-2025'),
    'четвёртый ярус НГ (скольз. опалубка) блок IV-3-4': ('09-10-2025', '12-11-2025'),
    'четвёртый ярус НГ (ячейки)': ('13-10-2025', '16-01-2026'),
    'пятый ярус НГ': ('02-12-2025', '03-03-2026'),
    'шестой ярус НГ': ('15-12-2025', '04-04-2026'),
}

data_gmo = {
    'левобережная ОВГ': ('04-06-2025', '14-07-2025'),
    'правобережная ОВГ': ('25-06-2025', '04-08-2025'),
    'пазовые конструкции и закладные части ОВГ': ('07-03-2026', '12-04-2026'),
    'гидроприводы и затворы ОВГ': ('13-04-2026', '28-05-2026'),
    'пороги, пазовые конструкции и решётки СУР': ('28-04-2026', '28-05-2026'),
    'пороги и монтажные рамы подпятников ОДВ НГ': ('17-08-2025', '11-09-2025'),
    'пятовые устройства и первые два яруса вереяльных колонн ОДВ НГ': ('16-10-2025', '17-11-2025'),
    'вертикальная облицовка ОДВ НГ (1 ярус), подушки закладные (1-4 яруса)': ('18-11-2025', '17-12-2025'),
    'поддерживающие конструкции для сборки створок ОДВ НГ': ('18-12-2025', '01-01-2026'),
    'вертикальная облицовка ОДВ НГ (2 ярус), подушки закладные (5-8 яруса)': ('08-03-2026', '06-04-2026'),
    'анкера гальсбантов ОДВ НГ': ('07-04-2026', '07-05-2026'),
    'створки ОДВ НГ': ('02-01-2026', '12-05-2026'),
    'гидроприводы и гальсбанты ОДВ НГ': ('13-05-2026', '27-05-2026'),
    'мостик пешеходный ОДВ НГ': ('28-06-2026', '10-07-2026'),
    'уплотнение ОДВ НГ': ('28-05-2026', '15-06-2026'),
    'рама отбойная ОДВ НГ': ('28-05-2026', '27-06-2026'),
    'пороги, колонны кронштейна, кронштейн закладной РДВ НГ': ('20-07-2025', '17-08-2025'),
    'закладные уголки': ('16-10-2025', '27-10-2025'),
    'колонны подушек, рамы подпятников, пятовые устройства, подушки РДВ НГ': ('28-10-2025', '02-12-2025'),
    'поддерживающие конструкции для сборки створок РДВ НГ': ('03-12-2025', '18-12-2025'),
    'створки РДВ НГ': ('19-12-2025', '27-05-2026'),
    'мостик пешеходный РДВ НГ': ('28-06-2026', '10-07-2026'),
    'уплотнение РДВ НГ': ('28-05-2026', '15-06-2026'),
    'рама отбойная РДВ НГ': ('28-05-2026', '27-06-2026'),
    'приспособление для подъёма створок в ремонтное положение': ('11-07-2026', '28-08-2026'),
    'секция 2 КШ закладные и рым': ('08-09-2025', '10-10-2025'),
    'секция 3 КШ закладные и рым': ('11-10-2025', '12-11-2025'),
    'секция 4 КШ закладные и рым': ('13-11-2025', '14-12-2025'),
    'секция 5 КШ закладные и рым': ('02-07-2025', '03-08-2025'),
    'секция 6 КШ закладные и рым': ('18-07-2025', '19-08-2025'),
    'секция 7 КШ закладные и рым': ('15-06-2025', '17-07-2025'),
    'секция 8 КШ закладные и рым': ('15-06-2025', '17-07-2025'),
    'секция 9 КШ закладные и рым': ('13-05-2025', '14-06-2025'),
    'секция 10 КШ закладные и рым': ('18-07-2025', '19-08-2025'),
    'секция 11 КШ закладные и рым': ('20-08-2025', '21-09-2025'),
    'секция 12 КШ закладные и рым': ('20-08-2025', '21-09-2025'),
    'система майнообразования и льдоотгона': ('28-05-2026', '28-06-2026'),
    'реконструкция двустворчатых ворот 30,0-14,04-13,14': ('01-01-2026', '08-03-2026'),
    'монтаж накатной платформы': ('11-07-2026', '28-08-2026')
}


def parse_date(date_str):
    return datetime.strptime(date_str, '%d-%m-%Y').date()

# def sort_key(e):
#     for start_date in e[1]:
#         return parse_date(start_date)

event_names_conc = []
start_dates_conc = []
end_dates_conc = []
event_names_gmo = []
start_dates_gmo = []
end_dates_gmo = []


for event, dates in reversed(data_conc.items()):
    start_date, end_date = map(parse_date, dates)
    event_names_conc.append(event)
    start_dates_conc.append(start_date)
    end_dates_conc.append(end_date)

for event, dates in reversed(data_gmo.items()):
    start_date, end_date = map(parse_date, dates)
    event_names_gmo.append(event)
    start_dates_gmo.append(start_date)
    end_dates_gmo.append(end_date)

fig, ax = plt.subplots()


width = 0.5

for i, events in enumerate(event_names_gmo):
    color = 'tab:red'
    ax.broken_barh([(start_dates_gmo[i], end_dates_gmo[i] - start_dates_gmo[i])],
                   (i - width / 2, width),
                   facecolors=color)
    days_word = 'день' if int((end_dates_gmo[i] - start_dates_gmo[i]).days) % 10 == 1 and int((end_dates_gmo[i] - start_dates_gmo[i]).days) != 11 \
        else ('дня' if int((end_dates_gmo[i] - start_dates_gmo[i]).days) % 10 in range(2, 5) and int((end_dates_gmo[i] - start_dates_gmo[i]).days)
        not in range(11, 16) else 'дней')
    x_text = start_dates_gmo[i] + (end_dates_gmo[i] - start_dates_gmo[i])/2
    y_text = i + 0.5
    ax.text(x_text, y_text, f'{start_dates_gmo[i].strftime("%d-%m-%Y")} - {end_dates_gmo[i].strftime("%d-%m-%Y")}, '
                            f'{(end_dates_gmo[i] - start_dates_gmo[i]).days} {days_word}', ha='center', va='center', fontsize=5)

for i, events in enumerate(event_names_conc):
    color = 'tab:blue'
    ax.broken_barh([(start_dates_conc[i], end_dates_conc[i] - start_dates_conc[i])],
                   (i - width / 2 + len(event_names_gmo), width),
                   facecolors=color)
    days_word = 'день' if int((end_dates_conc[i] - start_dates_conc[i]).days) % 10 == 1 and int((end_dates_conc[i] - start_dates_conc[i]).days) != 11 \
        else ('дня' if int((end_dates_conc[i] - start_dates_conc[i]).days) % 10 in range(2, 5) and int((end_dates_conc[i] - start_dates_conc[i]).days)
        not in range(11, 16) else 'дней')
    x_text = start_dates_conc[i] + (end_dates_conc[i] - start_dates_conc[i])/2
    y_text = i + len(event_names_gmo) + 0.5
    ax.text(x_text, y_text, f'{start_dates_conc[i].strftime("%d-%m-%Y")} - {end_dates_conc[i].strftime("%d-%m-%Y")}, '
                            f'{(end_dates_conc[i] - start_dates_conc[i]).days} {days_word}', ha='center', va='center', fontsize=5)

# Добавляем фиктивные элементы для легенды
ax.barh(-1, 0, height=0, color='tab:blue', label='Устройство бетонных конструкций')
ax.barh(-1, 0, height=0, color='tab:red', label='Монтаж ГМО')
ax.legend(fontsize=8, loc='upper right',frameon=True ,framealpha=1)

# Настройки графика
ax.set_yticks(range(len(event_names_conc + event_names_gmo)))
ax.set_yticklabels(event_names_gmo + event_names_conc)
start_date = datetime(2024, 12, 10)
ax.set_xlim(left=start_date, right=max(end_dates_gmo))
ax.set_title('График монтажа ГМО Городецкого гидроузла')
ax.xaxis.set_major_locator(mdates.MonthLocator())
ax.xaxis.set_major_formatter(mdates.DateFormatter('%b %Y'))
# Показать график
plt.xticks(rotation=90, fontsize=8)
plt.yticks(fontsize=8)
plt.grid(True, which='both', color='black', linewidth=1)
plt.grid(True, which='minor', linestyle=':', color='grey', linewidth=0.5)
plt.plot()
plt.show()